app/controllers/photos_controller.rb

INSERT INTO "photos" ("url", "vote", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT  "photos".* FROM "photos" WHERE "photos"."url" = ? LIMIT 1  [["url", "https://irs0.4sqi.net/img/general/1920x1440/751438_syHL1e0jyBBCkej2Lk5HV_QI7G6ZZJ7hpckDMTtmi8A.jpg"]]
UPDATE "photos" SET "vote" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["vote", "f"], ["updated_at", "2015-09-23 22:07:40.567687"], ["id", 7]]
SELECT  "photos".* FROM "photos" WHERE "photos"."url" = ? AND "photos"."vote" = ? LIMIT 1  [["url", "https://irs0.4sqi.net/img/general/960x720/1964536_l1xK33azV7MNp8HKanHFlgodpEQDWq3iY8ERjV11F0M.jpg"], ["vote", "false"]]
INSERT INTO "dislikes" ("photo_id") VALUES (?)  [["photo_id", 8]]
INSERT INTO "likes" ("photo_id") VALUES (?)  [["photo_id", 9]]
SELECT "likes".* FROM "likes" WHERE "likes"."photo_id" = ?  [["photo_id", 9]]
---
  def create
    if params["commit"] == "Bad Picture"
      @photo = Photo.find_or_create_by(url: params["url"])
      @photo.update(vote: false)
      redirect_to root_path if @photo.save
    elsif params["commit"] == "Don't Want"
      @photo = Photo.find_or_create_by(url: params["url"])
      @dislike = @photo.dislikes.create(photo_id: @photo.id)
      @dislike.save
      redirect_to root_path
    else params["commit"] == "Want"
      @photo = Photo.find_or_create_by(url: params["url"])